[
    {
      "name": "الرَّحْمَنُ",
      "inEnglish": "Ar-Rhmaan",
      "inUrdu": "رحمٰن",
      "short": "He who wills goodness and mercy for all His creatures",
      "long": "Allah is Ar-Rahmaan, The One who blesses all his creation with prosperity and devoid from disparity. He is most merciful, kind and loving towards all creation. He is all inclusive and embraces all.",
      "number": 1,
      "meaning": {
        "english": "The Beneficent",
        "urdu": "انتہائی مہربان"
      }
    },
    {
      "name": "الرَّحِيمُ",
      "inEnglish": "Ar-Raheem",
      "inUrdu": "رحیم",
      "short": "He who acts with extreme kindness",
      "long": "Ar-Rahmaan and Ar-Raheem (Ar- Rahim) are two of the names of Allah which refer to Allah’s attribute of being Merciful. Although similarly related the meanings are different. Ar-Rahmaan refers to the vastness of Allah’s mercy, and Ar-Raheem refers specifically to His mercy he bestows on His creation.",
      "number": 2,
      "meaning": {
        "english": "The Merciful",
        "urdu": "انتہائی رحم کرنے والا"
      }
    },
    {
      "name": "الْمَلِكُ",
      "inEnglish": "Al-Malik",
      "inUrdu": "مالک",
      "short": "The Sovereign Lord, The One with the complete Dominion, the One Whose Dominion is clear from imperfection",
      "long": "Allah is Al Malik, the literal meaning in Arabic is “The King”. The One who reigns dominion over the heavens and the earth and everything that resides within them. There is nothing above Him and He is alone.",
      "number": 3,
      "meaning": {
        "english": "The King \/ Eternal Lord",
        "urdu": "مالک، بادشاہ"
      }
    },
    {
      "name": "الْقُدُّوسُ",
      "inEnglish": "Al-Quddus",
      "inUrdu": "قدوس",
      "short": "The One who is pure from any imperfection and clear from children and adversaries",
      "long": "Allah is free of any imperfection, he has no shortcomings, and evil are not attributed to Him. For all that is perfect and sublime attributes belong to Him.",
      "number": 4,
      "meaning": {
        "english": "The Purest",
        "urdu": "مقدس، پاک، عیبوں سے پاک"
      }
    },
    {
      "name": "السَّلاَمُ",
      "inEnglish": "As-Salaam",
      "inUrdu": "سلام",
      "short": "The Embodiment of Peace The One who is free from every imperfection.",
      "long": "He is the One who grants peace and security to all his creation. Allah is above and beyond all weaknesses, and infliction. He is source of peace and security for mankind. It is mankind that needs peace and security through Him. Breaking away from As-Salam brings disturbance and destruction on oneself.",
      "number": 5,
      "meaning": {
        "english": "The Source of Peace",
        "urdu": "سلامتی والا"
      }
    },
    {
      "name": "الْمُؤْمِنُ",
      "inEnglish": "Al-Mu'min",
      "inUrdu": "مومن",
      "short": "He who acts with extreme kindness",
      "long": "The One who witnessed for Himself that no one is God but Him. And He witnessed for His believers that they are truthful in their belief that no one is God but Him",
      "number": 6,
      "meaning": {
        "english": "The inspirer of faith",
        "urdu": "ایمان عطاء کرنے والا، امن دینے والا"
      }
    },
    {
      "name": "الْمُهَيْمِنُ",
      "inEnglish": "Al-Muhaymin",
      "inUrdu": "مہیمن",
      "short": "The One who witnesses the saying and deeds of His creatures",
      "long": "Al Muhaymin is the one who ensures well being and protection over his creation. He is ever watchful and offers peace and security. He is the trustworthy one who proclaims truth.",
      "number": 7,
      "meaning": {
        "english": "The Guardian",
        "urdu": "محافظ"
      }
    },
    {
      "name": "الْعَزِيزُ",
      "inEnglish": "Al-Aziz",
      "inUrdu": "عزیز",
      "short": "The Strong, The Defeater, The One Who is not Defeated",
      "long": "Al-Aziz is The One who is most powerful and all-strong. He is the conqueror that is never conquered and never harmed. This is because His strength, glory and power are overwhelming and cannot be overcome or resisted. He is the only one with complete mastery over all creation. The One who is the cherished source of all strength, power and potency.",
      "number": 8,
      "meaning": {
        "english": "The Precious \/ The Most Mighty",
        "urdu": "غالب، زبردست، غلبہ والا، عزت دینے والا"
      }
    },
    {
      "name": "الْجَبَّارُ",
      "inEnglish": "Al-Jabbaar",
      "inUrdu": "جبار",
      "short": "The One that nothing happens in His Dominion except that which He willed",
      "long": "Al Jabbar is the highest, whatever he decrees will come to pass without fail. He restores all of creation. He heals the broken hearted, binds their wounds, brings comfort to the weak. He compels each and everything to his divine will but is never Himself compelled.",
      "number": 9,
      "meaning": {
        "english": "The Compeller",
        "urdu": "زبردست"
      }
    },
    {
      "name": "الْمُتَكَبِّرُ",
      "inEnglish": "Al-Mutakabbir",
      "inUrdu": "متکبر",
      "short": "The One who is clear from the attributes of the creatures and from resembling them.",
      "long": "Al-Mutakabbir is the supremely great. He is exalted far above all creation. He has rights and privileges and attributes which others do not have. He is truly great and manifests this greatness in all things and in many ways.",
      "number": 10,
      "meaning": {
        "english": "The Greatest",
        "urdu": "بڑائی والا، بزرگی والا"
      }
    },
    {
      "name": "الْخَالِقُ",
      "inEnglish": "Al-Khaaliq",
      "inUrdu": "خالق",
      "number": 11,
      "short": "The One who brings everything from non-existence to existence.",
      "long": "Al Khaaliq is the one who creates things from nothing with no precedents. He creates what He pleases and in a perfect manner. He is the only one who determines when, how and what to create and does so from nothing.",
      "meaning": {
        "english": "The Creator",
        "urdu": "پیدا کرنے والا"
      }
    },
    {
      "name": "الْبَارِئُ",
      "inEnglish": "Al-Baari",
      "inUrdu": "الباری",
      "short": "The Maker, The Creator who has the Power to turn the entities.",
      "long": "Al Baari is the one who decreed things to exist out of nothing in a specific manner. Creates shape from nothing that has no model or similarity. He manifests his creations in perfect harmony and in perfect proportions without any faults.",
      "number": 12,
      "meaning": {
        "english": "The Maker of Order",
        "urdu": "پیدا کرنے والا"
      }
    },
    {
      "name": "الْمُصَوِّرُ",
      "inEnglish": "Al-Musawwir",
      "inUrdu": "مصور",
      "short": "The One who forms His creatures in different pictures.",
      "long": "Allah is Al-Musawwir and he brings into existence whatever he wills and in whatever manner he wills it. He says “Be!” and it is. He is the fashioner of every creation and has given it a special form whereby it is distinguished.",
      "number": 13,
      "meaning": {
        "english": "The Shaper of Beauty",
        "urdu": "صورت بنانے والا"
      }
    },
    {
      "name": "الْغَفَّارُ",
      "inEnglish": "Al-Ghaffaar",
      "inUrdu": "غفار",
      "short": "The Forgiver, The One who forgives the sins of His slaves time and time again.",
      "long": "Allah is Al-Ghafaar and Al-Ghafoor. He sees ours sins and disobedience, yet he will still forgive and accept repentance of all those who turn to Him. He shows never ending compassion and forgives any sin, small or big, of his worshipers.",
      "number": 14,
      "meaning": {
        "english": "The Forgiving",
        "urdu": "بخشنے والا"
      }
    },
    {
      "name": "الْقَهَّارُ",
      "inEnglish": "Al-Qahhaar",
      "inUrdu": "قھار",
      "short": "The Dominant, The One who has the perfect Power and is not unable over anything.",
      "long": "Al-Qahhaar is the 15th name of Allah meaning The One who prevails over all creation. The universe runs according to the laws laid down by Allah. He is dominant, the master of all and is victorious over all opposition.",
      "number": 15,
      "meaning": {
        "english": "The Subduer",
        "urdu": "زبردست، قہر نازل کرنے والا"
      }
    },
    {
      "name": "الْوَهَّابُ",
      "inEnglish": "Al-Wahhab",
      "inUrdu": "وہاب",
      "short": "The One who is Generous in giving plenty without any return. He is everything that benefits whether Halal or Haram.",
      "long": "Allah is Al Wahhab which means the great giver whose blessings are freely and perpetually given. He gives with no purpose and expects nothing in return. Allah is truly the most liberal giver, He gives to the deserving and undeserving, to the good and the evil.",
      "number": 16,
      "meaning": {
        "english": "The Giver of All",
        "urdu": "عطاء کرنے والا"
      }
    },
    {
      "name": "الرَّزَّاقُ",
      "inEnglish": "Ar-Razzaq",
      "inUrdu": "رزاق",
      "short": "The Sustainer, The Provider.",
      "long": "Ar-Razzaq the provider of sustenance for all His creatures. He is The One who creates all means of nourishment and gives them their livelihood. He is the provider of growth for all things good for the body, the soul, and the mind.",
      "number": 17,
      "meaning": {
        "english": "The Sustainer",
        "urdu": "رزق دینے والا"
      }
    },
    {
      "name": "الْفَتَّاحُ",
      "inEnglish": "Al-Fattah",
      "inUrdu": "فتح",
      "short": "The Opener, The Reliever, The Judge, The One who opens for His slaves the closed worldly and religious matters.",
      "long": "Al Fattah is The Opener, The Revealer, and The Granter of success. He opens what is closed and makes what is unclear, clear. He has the best of judgement and holds the keys to victory and success.",
      "number": 18,
      "meaning": {
        "english": "The Opener",
        "urdu": "کھولنے والا"
      }
    },
    {
      "name": "اَلْعَلِيْمُ",
      "inEnglish": "Al-Aleem",
      "inUrdu": "علیم",
      "short": "The Knowledgeable; The One nothing is absent from His knowledge.",
      "long": "Allah is Al-Alim, Allah’s knowledge is comprehensive and extends to all that is seen and unseen, apparent and hidden, present and future, near and far. His knowledge precedes and he is intuitively aware of all things, even before they happen. He is the is the knower of all details and nothing goes unnoticed or unrecorded. Truly, He is the Omniscient One.",
      "number": 19,
      "meaning": {
        "english": "The Knower of all",
        "urdu": "جاننے والا، علم والا، باخبر"
      }
    },
    {
      "name": "الْقَابِضُ",
      "inEnglish": "Al-Qabid",
      "inUrdu": "قابض",
      "short": "The Constrictor, The Withholder, The One who constricts the sustenance by His wisdom and expands and widens it with His Generosity and Mercy.",
      "long": "Allah is Al-Qabid meaning whatever he wills comes to be. He is the one who enriches and makes poor, he decides to withhold something, or make something scarce. He is the taker of all souls at the time of death and he stretches his hand out to the believers so that they may repent and turn to him.",
      "number": 20,
      "meaning": {
        "english": "The Constrictor",
        "urdu": "قبض کرنے والا"
      }
    },
    {
      "name": "الْبَاسِطُ",
      "inEnglish": "Al-Baasit",
      "inUrdu": "باسط",
      "short": "The Englarger, The One who constricts the sustenance by His wisdom and expands and widens it with His Generosity and Mercy.",
      "long": "Allah is Al-Baasit, The One who amplifies all abundance, who makes the way wide open. He gives plentiful to whoever he wills and reaches out a helping hand to all mankind. Allah gives provision and mercy as he wishes.",
      "number": 21,
      "meaning": {
        "english": "The Reliever",
        "urdu": "فراخ کرنے والا"
      }
    },
    {
      "name": "الْخَافِضُ",
      "inEnglish": "Al-Khaafid",
      "inUrdu": "خافض",
      "short": "The Abaser, The One who lowers whoever He willed by His Destruction and raises whoever He willed by His Endowment.",
      "long": "Allah is Al-Khaafid with this name he abases the proud, the oppressors, and rebels. He chooses the ones to be humbled, softened or made gentle. He decides to raise or weaken people as a test.",
      "number": 22,
      "meaning": {
        "english": "The Abaser",
        "urdu": "پست کرنے والا"
      }
    },
    {
      "name": "الرَّافِعُ",
      "inEnglish": "Ar-Rafi",
      "inUrdu": "رافع",
      "short": "The Exalter, The Elevator, The One who lowers whoever He willed by His Destruction and raises whoever He willed by His Endowment.",
      "long": "Allah is Ar-Rafi, The One who chooses whom will be raised in rank. He elevates mankind above worldly possessions and selfishness.",
      "number": 23,
      "meaning": {
        "english": "The Exalter",
        "urdu": "بلند کرنے والا"
      }
    },
    {
      "name": "الْمُعِزُّ",
      "inEnglish": "Al-Mu'izz",
      "inUrdu": "المعز",
      "short": "He gives esteem to whoever He willed, hence there is no one to degrade Him; And He degrades whoever He willed, hence there is no one to give Him esteem.",
      "long": "Allah is Aziz (possessor of glory) and Mu’izz (giver of glory). He gives strength and honor to his obedient and loving servants. He gives material power to whoever he wills. He strengthens, glorifies, and makes it possible for someone or something to be respected.",
      "number": 24,
      "meaning": {
        "english": "The Bestower of Honour",
        "urdu": "عزت دینے والا"
      }
    },
    {
      "name": "المُذِلُّ",
      "inEnglish": "Al-Muzil",
      "inUrdu": "مزل",
      "short": "The Dishonourer, The Humiliator, He gives esteem to whoever He willed, hence there is no one to degrade Him; And He degrades whoever He willed, hence there is no one to give Him esteem.",
      "long": "Allah is Al Muzil, The Dishonorer, The Disgracer, The Degrader and The Humiliator. Allah humiliates those who disbelieve or disobey him. Once a man is digraced by Allah, he will never be honoured.",
      "number": 25,
      "meaning": {
        "english": "The Humiliator",
        "urdu": "ذلت دینے والا"
      }
    },
    {
      "name": "السَّمِيعُ",
      "inEnglish": "As-Sami'",
      "inUrdu": "سمیع",
      "short": "The Hearer, The One who Hears all things that are heard by His Eternal Hearing without an ear, instrument or organ.",
      "long": "Allah is As-Sami. He hears everything and sees everything. He pays attention to every supplication, invocation, listening to all who reach out to him. Whether we speak loudly or in secrecy he hears every word.",
      "number": 26,
      "meaning": {
        "english": "The Hearer of all",
        "urdu": "سننے والا"
      }
    },
    {
      "name": "الْبَصِيرُ",
      "inEnglish": "Al-Baseer",
      "inUrdu": "بصیر",
      "short": "The All-Noticing, The One who Sees all things that are seen by His Eternal Seeing without a pupil or any other instrument.",
      "long": "Allah is Al-Baseer he sees everything all the time. He understands all that has and will be. He has insight into all things and does not miss any detail. His sight is not limited to the outside but also knows what exists inside your heart.",
      "number": 27,
      "meaning": {
        "english": "The Seer of all",
        "urdu": "دیکھنے والا"
      }
    },
    {
      "name": "الْحَكَمُ",
      "inEnglish": "Al-Hakam",
      "inUrdu": "حکم",
      "short": "The Judge, He is the Ruler andThe Judge, He is the Ruler and His judgment is His Word. His judgment is His Word.",
      "long": "Allah is Al-Hakam meaning The Giver of Justice. His judgement once rendered cannot be thwarted. He always delivers justly in every situation and never makes a mistake. He is the best of judges.",
      "number": 28,
      "meaning": {
        "english": "The Judge",
        "urdu": "فیصلہ کرنے والا، حاکم"
      }
    },
    {
      "name": "الْعَدْلُ",
      "inEnglish": "Al-Adl",
      "inUrdu": "عدل",
      "short": "The Just, The One who is entitled to do what He does.",
      "long": "Allah is Al-Adl, The one who rectifies and sets matters straight in a just and equitable manner. He always delivers absolute justice through His wisdom without failure. He gives to each what he deserves and puts everything in its proper order.",
      "number": 29,
      "meaning": {
        "english": "The Just",
        "urdu": "انصاف کرنے والا"
      }
    },
    {
      "name": "اللَّطِيفُ",
      "inEnglish": "Al-Lateef",
      "inUrdu": "لطیف",
      "short": "The Subtle One, The Gracious, The One who is kind to His slaves and endows upon them.",
      "long": "Allah is Al-Lateef. The most gentle and gracious to people and cares for them although they may be oblivious to his acts. His nature is kind, affectionate, and understanding for the subtle details of individual circumstances. His actions are so fine and subtle they can not be apprehended by us by any means. He does things for you, you will never know. This is the name of Allah to call when asking for help through hardship.",
      "number": 30,
      "meaning": {
        "english": "The Subtle One",
        "urdu": "مہربان"
      }
    },
    {
      "name": "الْخَبِيرُ",
      "inEnglish": "Al-Khabeer",
      "inUrdu": "خبیر",
      "short": "The One who knows the truth of things.",
      "long": "Allah is Al-Khabeer. The Knower of reality, The One who’s knowledge is comprehensive knowing the qualities and meanings of all things. He knows and understands the most hidden secrets. Al-Khabir is The One who knows truth in every situation. He is all aware and nothing goes unnoticed.",
      "number": 31,
      "meaning": {
        "english": "The All Aware",
        "urdu": "خبردار، جاننے والا،خبر رکھنے والا"
      }
    },
    {
      "name": "الْحَلِيمُ",
      "inEnglish": "Al-Haleem",
      "inUrdu": "حلیم",
      "short": "The Forebearing, The One who delays the punishment for those who deserve it and then He might forgive them.",
      "long": "Allah is Al-Haleem, the most serene, kind and gentle. He does not punish people for every sin, he tolerates and is most gracious and merciful. He is ever calm and deliberate, never acting hastily, even with the wrongdoers. He gives us opportunity to learn and be kind.",
      "number": 32,
      "meaning": {
        "english": "The Forebearing",
        "urdu": "بردبار"
      }
    },
    {
      "name": "الْعَظِيمُ",
      "inEnglish": "Al-Azeem",
      "inUrdu": "عظیم",
      "short": "The Great One, The Mighty, The One deserving the attributes of Exaltment, Glory, Extolment, and Purity from all imperfection.",
      "long": "Allah is Al-Azeem, The Supreme Glory and The Greatest. His reality is too great to be fully understood under the capacity of the human mind. He is infinitely greater than his creation. It is said his throne (symbolic of his knowledge and authority) extends over the heavens and the earth, and the care of them burdens Him not, He is the Supreme, the Greatest.",
      "number": 33,
      "meaning": {
        "english": "The Maginificent",
        "urdu": "عظمت والا، بڑائی والا، بڑا"
      }
    },
    {
      "name": "الْغَفُورُ",
      "inEnglish": "Al-Ghafoor",
      "inUrdu": "غفور",
      "short": "The All-Forgiving, The Forgiving, The One who forgives a lot.",
      "long": "Allah is Al-Ghafoor, He is The One who completely forgives our sins and faults. His forgiveness is unlimited, and He is all compassionate. He is most high; His forgiveness extends to all who turn to him in humility and seek repentance.",
      "number": 34,
      "meaning": {
        "english": "The Great Forgiver",
        "urdu": "معافی دینے والا"
      }
    },
    {
      "name": "الشَّكُورُ",
      "inEnglish": "Ash-Shakoor",
      "inUrdu": "شکور",
      "short": "The Grateful, The Appreciative, The One who gives a lot of reward for a little obedience.",
      "long": "Allah is Ash-Shakoor meaning the most grateful, the rewarder of good deeds, and is most appreciative. Allah notices the smallest of our acts of righteousness and rewards us for them in this life or the next. He is bountiful in giving and bestows great rewards for small amount of good.",
      "number": 35,
      "meaning": {
        "english": "The Rewarder of Thankfulness",
        "urdu": "قدردان"
      }
    },
    {
      "name": "الْعَلِيُّ",
      "inEnglish": "Al-Aliyy",
      "inUrdu": "علی",
      "short": "The Most High, The One who is clear from the attributes of the creatures.",
      "long": "Allah is Al-Aliyy, the most exalted and most high. He exceeds all others and there is nothing higher. He is the one who’s rank, and station are the highest. He is above all that has or will ever be.",
      "number": 36,
      "meaning": {
        "english": "The Highest",
        "urdu": "اعلیٰ، سب سے افضل، برتر"
      }
    },
    {
      "name": "الْكَبِيرُ",
      "inEnglish": "Al-Kabeer",
      "inUrdu": "کبیر",
      "short": "The Most Great, The Great, The One who is greater than everything in status.",
      "long": "Allah is Al-Kabeer, the perfection of greatness. The heart of the believer knows Allah is the essence of perfection and nothing is comparable to him. His greatness is beyond measure and his being is unimaginable to the human mind.",
      "number": 37,
      "meaning": {
        "english": "The Greatest",
        "urdu": "بزرگی والا"
      }
    },
    {
      "name": "الْحَفِيظُ",
      "inEnglish": "Al-Hafeez",
      "inUrdu": "حفیظ",
      "short": "The Preserver, The Protector, The One who protects whatever and whoever He willed to protect.",
      "long": "Allah is Al-Hafiz, the guardian and protector of everything. He preserves all creations and remembers all that has ever been and all that is. He is the protector of The Quran and vowed to safe guard it from being changed or perverted as was the case with previous scriptures.",
      "number": 38,
      "meaning": {
        "english": "The Preserver",
        "urdu": "حفاظت کرنے والا، نگہبان"
      }
    },
    {
      "name": "المُقيِت",
      "inEnglish": "Al-Muqeet",
      "inUrdu": "مقیت",
      "short": "The Maintainer, The Guardian, The Feeder, The One who has the Power.",
      "long": "Allah is Al-Muqeet or the ultimate sustainer. He gives strength and nourishment to all of creation and maintains all that exists. He oversees, guards, and preserves all. To Allah we owe the satisfaction of all needs, but he himself is alone and independent of needs.",
      "number": 39,
      "meaning": {
        "english": "The Nourisher",
        "urdu": "باقی رہنے والا، روزی دینے والا، نگہبان، قوت دینے والا"
      }
    },
    {
      "name": "الْحسِيبُ",
      "inEnglish": "Al-Haseeb",
      "inUrdu": "حسیب",
      "short": "The Reckoner, The One who gives the satisfaction.",
      "long": "Allah is Al-Haseeb. He is The One who takes account all actions and reckons them on the day of judgement. There is nothing that goes unnoticed, however small, Allah surly will hold them responsible. He will give whatever is sufficient and necessary in every situation.",
      "number": 40,
      "meaning": {
        "english": "The Reckoner",
        "urdu": "حساب لینے والا"
      }
    },
    {
      "name": "الْجَلِيلُ",
      "inEnglish": "Al-Jaleel",
      "inUrdu": "جلیل",
      "short": "The Sublime One, The Beneficent, The One who is attributed with greatness of Power and Glory of status.",
      "long": "Allah is Al-Jaleel, the one who is great and above all in dignity and rank. He is majestic and the source of all attributes of greatness. To him all honour and sincere devotion is due.",
      "number": 41,
      "meaning": {
        "english": "The Majestic",
        "urdu": "بزرگ،"
      }
    },
    {
      "name": "الْكَرِيمُ",
      "inEnglish": "Al-Kareem",
      "inUrdu": "کریم",
      "short": "The Generous One, The Gracious, The One who is attributed with greatness of Power and Glory of status.",
      "long": "Allah is Al-Karim who is the most generous, bountiful and esteemed. He is The One whose kindness knows no bound and is continually giving precious gifts to whoever he wills. He is gracious in giving rewards in multiple even for the smallest acts.",
      "number": 42,
      "meaning": {
        "english": "The Generous",
        "urdu": "کرم کرنے والا"
      }
    },
    {
      "name": "الرَّقِيبُ",
      "inEnglish": "Ar-Raqib",
      "inUrdu": "رقیب",
      "short": "The Watcher, The One that nothing is absent from Him. Hence, it’s meaning is related to attribute of Knowledge.",
      "long": "Allah is Ar-Raqib, He watches all and never forgets what He has created. Allah is a vigilant witness and acts as a guardian protecting the weak and innocent. He observes all thoughts, deeds and feelings.",
      "number": 43,
      "meaning": {
        "english": "The Watchful One",
        "urdu": "خیال رکھنے والا"
      }
    },
    {
      "name": "الْمُجِيبُ",
      "inEnglish": "Al-Mujeeb ",
      "inUrdu": "مجیب",
      "short": "The Responsive, The Hearkener, The One who answers the one in need if he asks Him and rescues the yearned if he calls upon Him.",
      "long": "Allah is Al-Mujeeb, he is very close to his believers and readily willing to answer supplications of those who ask. He is the responder to all needs, invitations, and prayers. Whenever one needs help in difficulties, they should call upon this name of Allah.",
      "number": 44,
      "meaning": {
        "english": "The Responder to Prayer",
        "urdu": "قبول کرنے والا"
      }
    },
    {
      "name": "الْوَاسِعُ",
      "inEnglish": "Al-Waasi'",
      "inUrdu": "واسع",
      "short": "The Vast, The All-Embracing, The Knowledgeable.",
      "long": "Allah is Al-Wasi who’s knowledge, mercy, and provision are vast. He is of limitless capacity and abundance who gives without expecting anything in return. Allah embraces all things and His wisdom and mercy are boundless.",
      "number": 45,
      "meaning": {
        "english": "The All Comprehending",
        "urdu": "لامحدود"
      }
    },
    {
      "name": "الْحَكِيمُ",
      "inEnglish": "Al-Hakeem",
      "inUrdu": "حکیم",
      "short": "The Wise, The Judge of Judges, The One who is correct in His doings.",
      "long": "Allah is Al-Hakeem, the most judicious and most wise. He possesses the ability to determine right from wrong and is free from error and misunderstanding. His design in nature and life are perfect and accurate. He is the only one qualified to judge the worth of all things.",
      "number": 46,
      "meaning": {
        "english": "The Perfectly Wise",
        "urdu": "حکمت والا"
      }
    },
    {
      "name": "الْوَدُودُ",
      "inEnglish": "Al-Wudood",
      "inUrdu": "ودود",
      "short": "The Most Loving, The Most Affectionate, The Beloved.",
      "long": "Allah is Al-Wadud, the most loving and affectionate. He is faithful to his servants and shows them the purest love. He is the singular source of all love and kindness. The One who loves His believing slaves and His believing slaves love Him.",
      "number": 47,
      "meaning": {
        "english": "The Loving One",
        "urdu": "محبت کرنے والا"
      }
    },
    {
      "name": "الْمَجِيدُ",
      "inEnglish": "Al-Majeed",
      "inUrdu": "مجید",
      "short": "The Most Glorious One, The One who is with perfect Power, High Status, Compassion, Generosity and Kindness.",
      "long": "Allah is Al-Majeed which is another name which covers several attributes. He is the most glorious, honorable, dignified, noble, and generous. He is the only one deserving of all praise and honor.",
      "number": 48,
      "meaning": {
        "english": "The Most Glorious One",
        "urdu": "بزرگی والا"
      }
    },
    {
      "name": "الْبَاعِثُ",
      "inEnglish": "Al-Ba'ith",
      "inUrdu": "باعث",
      "short": "The Awakener, The Resurrector, The Arouser.",
      "long": "Allah is Al-Ba’ith, The One who chooses who will be awaken and be sent forth. He is the giver of life and who sends light into the worlds. The One who resurrects His slaves after death for reward and/or punishment.",
      "number": 49,
      "meaning": {
        "english": "The Resurrector",
        "urdu": "اسباب پیدا کرنے والا"
      }
    },
    {
      "name": "الشَّهِيدُ",
      "inEnglish": "Ash-Shaheed",
      "inUrdu": "شہید",
      "short": "The Witness, The One who nothing is absent from Him.",
      "long": "Allah is Ash-Shaheed, there is nothing that we do that goes unnoticed as He is ever-present and observes everything. His knowledge comprehends all and He will be the ultimate witness on the day of judgement.",
      "number": 50,
      "meaning": {
        "english": "The Witness",
        "urdu": "گواہ"
      }
    },
    {
      "name": "الْحَقُّ",
      "inEnglish": "Al-Haqq",
      "inUrdu": "حق",
      "short": "The Truth, The True, The One who truly exists",
      "long": "Allah is Al-Haqq, the only reality, The One who is the truth. Since he is the only one and true God, he has every right to be worshipped. His essence is unavoidable.",
      "number": 51,
      "meaning": {
        "english": "The Truth",
        "urdu": "سچ"
      }
    },
    {
      "name": "الْوَكِيلُ",
      "inEnglish": "Al-Wakeel",
      "inUrdu": "وکیل",
      "short": "The Trustee, The One who gives the satisfaction and is relied upon.",
      "long": "Allah is Al-Wakeel the one and only who can be trusted with all our affairs. He is the supreme trustee, guardian and administrator. A true believer understands the rewards of his efforts comes from Allah and therefore he entrusts his faith fully in Him and no one else.",
      "number": 52,
      "meaning": {
        "english": "The Trustee",
        "urdu": "وکیل،کارساز"
      }
    },
    {
      "name": "الْقَوِيُّ",
      "inEnglish": "Al-Qawiyy",
      "inUrdu": "قوی",
      "short": "The Most Strong, The Strong, The One with the complete Power.",
      "long": "Allah is Al-Qawiyy, The One who commands all power and whose strength is unparallel to anything else in this universe. His strength is truly unlimited and inexhaustible. Man’s strength does not even compare to that of Allah.",
      "number": 53,
      "meaning": {
        "english": "The Possessor of all strength",
        "urdu": "سب سے زیادہ طاقتور"
      }
    },
    {
      "name": "الْمَتِينُ",
      "inEnglish": "Al-Mateen",
      "inUrdu": "متین",
      "short": "The One with extreme Power which is un-interrupted and He does not get tired.",
      "long": "Allah is Al-Matin meaning His power is steadfast. It is the same as it was yesterday and as it will remain tomorrow. He is ever constant, firm, and loyal.",
      "number": 54,
      "meaning": {
        "english": "The Forceful",
        "urdu": "مضبوط، قوت والا"
      }
    },
    {
      "name": "الْوَلِيُّ",
      "inEnglish": "Al-Waliyy",
      "inUrdu": "ولی",
      "short": "The Protecting Friend, The Supporter.",
      "long": "Allah is Al-Waliyy, The true protector. He is supportive and loves his servants protecting them from evil. Allah wants victory for us and will guide mankind towards the path of righteousness.",
      "number": 55,
      "meaning": {
        "english": "The Protector",
        "urdu": "دوست"
      }
    },
    {
      "name": "الْحَمِيدُ",
      "inEnglish": "Al-Hameed",
      "inUrdu": "حمید",
      "short": "The Praiseworthy, The praised One who deserves to be praised.",
      "long": "Allah is Al-Hameed, the only one worthy of praise for he has given us all that we have. He is The One who deserves every manner of praise and we should exalt him. Join in extolling him by repeating ‘al-hamdu lillah meaning ‘praise be to Allah’.",
      "number": 56,
      "meaning": {
        "english": "The Praised",
        "urdu": "تعریف والا"
      }
    },
    {
      "name": "الْمُحْصِي",
      "inEnglish": "Al-Muhsi",
      "inUrdu": "محصی",
      "short": "The Counter, The Reckoner, The One who the count of things are known to him.",
      "long": "Allah is Al-Muhsi, The One who takes account all things in the universe and knows the details of every moment or changes. He comprehends everything and possesses all knowledge. Every deed is known by Allah and written details are recorded by His angels.",
      "number": 57,
      "meaning": {
        "english": "The Appraiser",
        "urdu": "شمار کرنے والا"
      }
    },
    {
      "name": "الْمُبْدِئُ",
      "inEnglish": "Al-Mubdi",
      "inUrdu": "مبدئ",
      "short": "The One who started the human being. That is, He created him.",
      "long": "Allah is Al-Mubdi, the originator of all creation. He is the beginner of all things and nothing could have existed without his willing it to be. He is The One who initiates all things.",
      "number": 58,
      "meaning": {
        "english": "The Originator",
        "urdu": "عدم سے عالم کو وجود لانے والا"
      }
    },
    {
      "name": "الْمُعِيدُ",
      "inEnglish": "Al-Mu'eed",
      "inUrdu": "معید",
      "short": "The Reproducer, The One who brings back the creatures after death.",
      "long": "Allah is Al-Mu'eed, The One who (on the day of resurrection) will recreate us back to life to be confronted with our actions on this earth.",
      "number": 59,
      "meaning": {
        "english": "The Restorer",
        "urdu": "لوٹانے والا، پناہ دینے والا"
      }
    },
    {
      "name": "الْمُحْيِي",
      "inEnglish": "Al-Muhyi",
      "inUrdu": "محیی",
      "short": "The Restorer, The Giver of Life.",
      "long": "Allah is Al-Muhyi, The One who took out a living human from semen that does not have a soul. He gives life by giving the souls back to the worn-out bodies on the resurrection day. He is The One who makes the hearts alive by the light of knowledge.",
      "number": 60,
      "meaning": {
        "english": "The Giver of life",
        "urdu": "زندگی دینے والا"
      }
    },
    {
      "name": "اَلْمُمِيتُ",
      "inEnglish": "Al-Mumeet",
      "inUrdu": "ممیت",
      "short": "The Creator of Death, The Destroyer, The One who renders the living dead.",
      "long": "Allah is Al-Mumeet, the one who gives life and the one who takes it away. He ordains who will become lifeless. Eventually we will all return to Him.",
      "number": 61,
      "meaning": {
        "english": "The Taker of life",
        "urdu": "موت دینے والا"
      }
    },
    {
      "name": "الْحَيُّ",
      "inEnglish": "Al-Haiyy",
      "inUrdu": "حی",
      "short": "The Alive, The One attributed with a life that is unlike our life and is not that of a combination of soul, flesh or blood.",
      "long": "Allah is Al-Hayy, The One who is undying and will be forever. He is perfect and not subject to death or sickness. He is eternally whole and sound whom all life arises from.",
      "number": 62,
      "meaning": {
        "english": "The Ever Living",
        "urdu": "زندہ، ہمیشہ رہنے والا"
      }
    },
    {
      "name": "الْقَيُّومُ",
      "inEnglish": "Al-Qayyum",
      "inUrdu": "قیوم",
      "short": "The Self-Subsisting, The Self-Existing One upon Whom all others depend",
      "long": "Al-Qayyum nature is to exist, completely free from dependence on anything or anyone. Al-Qayyum is the one through whom all things arise. He is Ever-Living and Self-Sustaining. Everything else in existence depends on Al-Qayyum.",
      "number": 63,
      "meaning": {
        "english": "The Self Existing",
        "urdu": "قائم رہنے والا"
      }
    },
    {
      "name": "الْوَاجِدُ",
      "inEnglish": "Al-Waajid",
      "inUrdu": "واجد",
      "short": "The Perceiver, The Finder, The Rich who is never poor. Al-Wajd is Richness.",
      "long": "Allah is Waajid, The One who does not need or lacks anything. He is the most resourceful and finds whatever He wills.",
      "number": 64,
      "meaning": {
        "english": "The Finder",
        "urdu": "حاصل کرنے والا"
      }
    },
    {
      "name": "الْمَاجِدُ",
      "inEnglish": "Al-Maajid",
      "inUrdu": "ماجد",
      "short": "The Glorious, He who is Most Glorious.",
      "long": "Allah is Al-Maajid, the most noble, magnificent and generous. He is the one who consistently gives for His wealth is endless. Truly Allah is most high and shows mankind a perfect example of richness and generosity.",
      "number": 65,
      "meaning": {
        "english": "The Glorious",
        "urdu": "بزرگی دینے والا"
      }
    },
    {
      "name": "الْواحِدُ",
      "inEnglish": "Al-Waahid",
      "inUrdu": "واحد",
      "short": "The Unique, The One, The One without a partner.",
      "long": "Allah is Al-Waahid, The One and the only God. There is no alternative, he is the sole originator from which all has arisen. He has no partners or relationships. None is equal to Him.",
      "number": 66,
      "meaning": {
        "english": "The Only One",
        "urdu": "اکیلا"
      }
    },
    {
      "name": "اَلاَحَدُ",
      "inEnglish": "Al-Ahad",
      "inUrdu": "احد",
      "short": "The One.",
      "long": "Allah is Al-Ahad, He is incomparable, unequalled, and indivisible. Al-Ahad is the One who was, is, and will ever remain alone. No one can ever be equal to Him in essence of all His beautiful attributes!",
      "number": 67,
      "meaning": {
        "english": "The One",
        "urdu": "ایک"
      }
    },
    {
      "name": "الصَّمَدُ",
      "inEnglish": "As-Samad",
      "inUrdu": "صمد",
      "short": "The Eternal, The Independent, The Master who is relied upon in matters and reverted to in ones needs. He is the only one a person should turn to when feeling helpless.",
      "long": "Allah is As-Samad, He is the one whom refuge is sought in times of adversity. He is eternal and satisfies every need as it should be satisfied.",
      "number": 68,
      "meaning": {
        "english": "The Supreme Provider",
        "urdu": "بے نیاز، مضبوط"
      }
    },
    {
      "name": "الْقَادِرُ",
      "inEnglish": "Al-Qaadir",
      "inUrdu": "قادر",
      "short": "The Able, The Capable, The One attributed with Power.",
      "long": "Allah is Al-Qaadir, the most powerful with the ability to measure out everything. Whenever he decrees a thing, it is. Nothing can interrupt or disturb the will of Allah.",
      "number": 69,
      "meaning": {
        "english": "The Powerful",
        "urdu": "قدرت والا"
      }
    },
    {
      "name": "الْمُقْتَدِرُ",
      "inEnglish": "Al-Muqtadir",
      "inUrdu": "مقتدر",
      "short": "The Powerful, The Dominant, The One with the perfect Power that nothing is withheld from Him.",
      "long": "Allah is Al-Muqtadir, the all powerful who deliver suitable measure of all things. He has absolute strength, power, and mastery. Nothing is beyond his power.",
      "number": 70,
      "meaning": {
        "english": "The Creator of all power",
        "urdu": "اقتدار والا،  قادر مطلق"
      }
    },
    {
      "name": "الْمُقَدِّمُ",
      "inEnglish": "Al-Muqaddim",
      "inUrdu": "مقدم",
      "short": "The Expediter, The Promoter, The One who puts things in their right places.",
      "long": "Allah is Al-Muqaddim, The One who promotes or brings forward. This include promoting his servants to higher ranks providing rich rewards.",
      "number": 71,
      "meaning": {
        "english": "The Expediter",
        "urdu": "آگے کرنے والا"
      }
    },
    {
      "name": "الْمُؤَخِّرُ",
      "inEnglish": "Al-Mu’akhkhir",
      "inUrdu": "موخر",
      "short": "The Delayer, The One who puts things in their right places. He makes ahead what He wills and delays what He wills.",
      "long": "Allah is Al-Mu’akhkhir, The One who delays or holds back. By his will, he can detain unbelievers on the day of judgement and hold them back.",
      "number": 72,
      "meaning": {
        "english": "The Delayer",
        "urdu": "پیچھے کرے والا"
      }
    },
    {
      "name": "الأوَّلُ",
      "inEnglish": "Al-Awwal",
      "inUrdu": "اول",
      "short": "The First, The One whose Existence is without a beginning.",
      "long": "Allah is Al-Awwal, He is The One whose existence is without beginning. He is truly the first and nothing was before Him.",
      "number": 73,
      "meaning": {
        "english": "The First",
        "urdu": "پہلا"
      }
    },
    {
      "name": "الآخِرُ",
      "inEnglish": "Al-Aakhir",
      "inUrdu": "اخر",
      "short": "The Last, The One whose Existence is without an end.",
      "long": "Allah is Al-Akhir, The One who’s existence will extend past the end of this universe. He will be the last just as he was the first.",
      "number": 74,
      "meaning": {
        "english": "The Last",
        "urdu": "آخر"
      }
    },
    {
      "name": "الظَّاهِرُ",
      "inEnglish": "Az-Zaahir",
      "inUrdu": "زاھر",
      "short": "The Manifest, The Conspicuous, The Evident",
      "long": "Allah is Az-Zaahir, The One who is evident and conspicuous. He made himself evident without being visible. The very essence and attributes are shown through all his creation.",
      "number": 75,
      "meaning": {
        "english": "The Manifest",
        "urdu": "ظاہر"
      }
    },
    {
      "name": "الْبَاطِنُ",
      "inEnglish": "Al-Baatin",
      "inUrdu": "باطن",
      "short": "The Hidden, The Secret One, The Inner One, The Knower of Hidden Things",
      "long": "Allah is Al-Baatin, or The One who is hidden or secret. Allah is unseen but his existence is known through signs. Allah immanent operating within all of creation. The one who is the secret inner companion.",
      "number": 76,
      "meaning": {
        "english": "The Hidden",
        "urdu": "چھپا ہوا، باطن کو جاننے والا"
      }
    },
    {
      "name": "الْوَالِي",
      "inEnglish": "Al-Waali",
      "inUrdu": "والی",
      "short": "The Governor, The One who owns things and manages them.",
      "long": "Allah is Al-Waali, The One who is the sole planner and governor of all things. He is fully supportive, helpful and master of all. He manages and disposes of things at his will based on his judgement.",
      "number": 77,
      "meaning": {
        "english": "The Governor",
        "urdu": "والی"
      }
    },
    {
      "name": "الْمُتَعَالِي",
      "inEnglish": "Al-Muta’ali",
      "inUrdu": "متعالی",
      "short": "The Most Exalted, The High Exalted, The One who is clear from the attributes of the creation.",
      "long": "Allah is Al-Muta’ali, The One who is most high and exalted above all creation. He is far beyond any imagination, thought, and the human mind is to narrow to understand his true greatness.",
      "number": 78,
      "meaning": {
        "english": "The Supreme One",
        "urdu": "بزرگ"
      }
    },
    {
      "name": "الْبَرُّ",
      "inEnglish": "Al-Barr",
      "inUrdu": "بر",
      "short": "The Source of All Goodness, The Righteous, The One who is kind to His creatures",
      "long": "Allah is Al-Barr, The One who is the great benefactor, the most righteous and the source of goodness. He is ample in kindness and desires good to people bestowing them with health, wealth, and happiness. He is ever merciful and compassionate. He is The One who covered them with His sustenance and specified whoever He willed among them by His support, protection, and special mercy.",
      "number": 79,
      "meaning": {
        "english": "The Doer of Good",
        "urdu": "نیکیوں کا سرچشمہ"
      }
    },
    {
      "name": "التَّوَابُ",
      "inEnglish": "At Tawwaab",
      "inUrdu": "تواب",
      "short": "The Acceptor of Repentance, The Oft-Forgiving, The Acceptor of our Return",
      "long": "Allah is At Tawwab, The One who beckons for our return. He repeatedly turns mankind towards repentance should they journey temporarily on the wrong path. Allah is lenient and restores grace to those who repent and forgives those who seek forgiveness.",
      "number": 80,
      "meaning": {
        "english": "The Guide to Repentence",
        "urdu": "توبہ قبول کرنے والا"
      }
    },
    {
      "name": "الْمُنْتَقِمُ",
      "inEnglish": "Al-Muntaqim",
      "inUrdu": "منتقم",
      "short": "The Avenger, The Disapprover, The Inflictor of Retribution",
      "long": "Allah is Al-Muntaqim, The One who victoriously prevails over His enemies and punishes them for their sins. Allah is most patient, but the time will come where justice must be given. Avoid things which Allah has forbidden for he punishes those when provoked.",
      "number": 81,
      "meaning": {
        "english": "The Avenger",
        "urdu": "انتقام لینے والا"
      }
    },
    {
      "name": "العَفُوُّ",
      "inEnglish": "Al-Afuww",
      "inUrdu": "عفو",
      "short": "The Pardoner, The Forgiver and The Eliminator of Sins.",
      "long": "Allah is Al-Afuw, The One who pardons sins and leaves no trace of any fault. He also pardons evil intentions if they do no materialize.",
      "number": 82,
      "meaning": {
        "english": "The Forgiver",
        "urdu": "معاف کرنے والا"
      }
    },
    {
      "name": "الرَّؤُوفُ",
      "inEnglish": "Ar-Ra’uf",
      "inUrdu": "رؤف",
      "short": "The Most Kind, The Tenderly Merciful, The Clement and Compassionate",
      "long": "Allah is Ar-Ra’uf, The One who is extremely compassionate. He is The One who’s mercy will endow whoever he willed among His creatures. Whatever Allah decrees is done with perfect judgement and He is never harsh or unjust in his rulings.",
      "number": 83,
      "meaning": {
        "english": "The Clement",
        "urdu": "رحم کرنے والا، شفقت کرنے ولا"
      }
    },
    {
      "name": "مَالِكُ الْمُلْكِ",
      "inEnglish": "Maalik Ul Mulk",
      "inUrdu": "مالک ملک",
      "short": "The One who controls the Dominion and gives dominion to whoever He willed.",
      "long": "Allah is Maalik Ul Mulk, The Lord of the Kingdom. He is the sole owner of all creation and with absolute authority can act in any manner, any time, and in anyway.",
      "number": 84,
      "meaning": {
        "english": "The Owner \/ Soverign of All",
        "urdu": "دو جہاں کا مالک"
      }
    },
    {
      "name": "ذُوالْجَلاَلِ وَالإكْرَامِ",
      "inEnglish": "Zul-Jalaali-wal-Ikram",
      "inUrdu": "زوالجلال اکرام",
      "short": "The Lord of Majesty and Bounty.",
      "long": "Allah is Zul-Jalaali-wal-Ikram, The One who is glorious and majestic. He is the possessor of all glory and honor. He is The One who deserves to be Exalted and not denied.",
      "number": 85,
      "meaning": {
        "english": "Possessor of Majesty and Bounty",
        "urdu": "لال اور انعام و اکرام والا"
      }
    },
    {
      "name": "الْمُقْسِطُ",
      "inEnglish": "Al-Muqsit",
      "inUrdu": "مقسط",
      "short": "The Equitable, The One who is Just in His judgment.",
      "long": "Allah is Al-Muqsit, The One who is most fair and just. He recognizes and provides rewards beyond measure for the any good, however small. He is the The One who leads mankind to justice and harmony.",
      "number": 86,
      "meaning": {
        "english": "The Equitable One",
        "urdu": "انصاف کرنے والا"
      }
    },
    {
      "name": "الْجَامِعُ",
      "inEnglish": "Al-Jaami'",
      "inUrdu": "جامع",
      "short": "The Gatherer, The One who gathers the creatures on a day that there is no doubt about, that is the Day of Judgment.",
      "long": "Allah is Al-Jaami’, He is The One who has power to assemble and arrange all that which has been dispersed. He is the one who composes and connects things together.",
      "number": 87,
      "meaning": {
        "english": "The Gatherer",
        "urdu": "جمع کرنے والا"
      }
    },
    {
      "name": "الْغَنِيُّ",
      "inEnglish": "Al-Ghaniyy",
      "inUrdu": "غنی",
      "short": "The One who does not need the creation.",
      "long": "Allah is Al-Ghaniyy, He is The One who is self-sufficient and independent. He does not need anything as He is completely satisfied and free from dependence. Allah is The One whose wealth and riches all others depend on.",
      "number": 88,
      "meaning": {
        "english": "The Rich One",
        "urdu": "غنی"
      }
    },
    {
      "name": "الْمُغْنِي",
      "inEnglish": "Al-Mughni",
      "inUrdu": "مغنی",
      "short": "The Enricher, The One who satisfies the necessities of the creatures.",
      "long": "Allah is Al-Mughni, He is The One who gives abundantly and provides all that is needed. He enriches all of creation so that they may be satisfied and content.",
      "number": 89,
      "meaning": {
        "english": "The Enricher",
        "urdu": "بے نیاز"
      }
    },
    {
      "name": "اَلْمَانِعُ",
      "inEnglish": "Al-Maani'",
      "inUrdu": "مانع",
      "short": "The Withholder.",
      "long": "Allah is Al-Maani, The One who withholds bounty from those undeserving. Allah protects people from harmful situations and prevents undesirable actions. He can withhold His light from those who deliberately reject Him.",
      "number": 90,
      "meaning": {
        "english": "The Preventer of harm",
        "urdu": "روکنے والا، باز رکھنے والا"
      }
    },
    {
      "name": "الضَّارَّ",
      "inEnglish": "Ad-Daarr",
      "inUrdu": "ضار",
      "short": "The Correcter, The Balancer, The Distresser, The Afflicter, The Punisher.",
      "long": "Allah is Ad-Daarr, The One who harms or benefits whoever he wills. He is the one whose wisdom may choose to use forceful corrections to discourage wrongful behavior.",
      "number": 91,
      "meaning": {
        "english": "The Creator of the harmful",
        "urdu": "نقصان کا مالک"
      }
    },
    {
      "name": "النَّافِعُ",
      "inEnglish": "An-Nafi",
      "inUrdu": "نافع",
      "short": "The Creator of Good, The Benefiter, The Propitious, The Auspicious",
      "long": "Allah is An-Nafi, The Propitious, The One who makes harm reach to whoever He willed and benefit to whoever He willed. It is impossible for man to earn any good without the will of Allah. He is the one who confers all benefits.",
      "number": 92,
      "meaning": {
        "english": "The Bestower of Benefits",
        "urdu": "نفع کا مالک، نفع دینے والا"
      }
    },
    {
      "name": "النُّورُ",
      "inEnglish": "An-Noor",
      "inUrdu": "نور",
      "short": "The Light, The One who guides.",
      "long": "Allah is An-Noor, The One who illuminates and reveals the divine light of all the worlds. His light illuminates the heart and provides clarity and guidance. Anyone who turns their back to the true light will be left in the darkness.",
      "number": 93,
      "meaning": {
        "english": "The Light",
        "urdu": "روشن، روشنی دینے والا"
      }
    },
    {
      "name": "الْهَادِي",
      "inEnglish": "Al-Haadi",
      "inUrdu": "ھادی",
      "short": "The Guide, The Leader, The Guide of the Right Path",
      "long": "Allah is Al Haadi, The One who gives guidance to his believers. His Guidance is beneficial and protects them from whatever may be harmful. He is The One who sent prophets as the deliverers of his message to make sure mankind is guided on the right path.",
      "number": 94,
      "meaning": {
        "english": "The Guider",
        "urdu": "ہدایت دینے والا، راستہ دکھانے والا"
      }
    },
    {
      "name": "الْبَدِيعُ",
      "inEnglish": "Al-Badi'",
      "inUrdu": "بدیع",
      "short": "The Wonderful Originator, The Unprecedented and Incomparable Inventor",
      "long": "Allah is Al-Badi, The One who created and formed the universe without any mold or preceding example. With His will he invents all that exists without any prior material. His creation is made without any similarity to anything else that has ever existed.",
      "number": 95,
      "meaning": {
        "english": "The Originator",
        "urdu": "نادر پیدا کرنے والا"
      }
    },
    {
      "name": "اَلْبَاقِي",
      "inEnglish": "Al-Baaqi",
      "inUrdu": "باقی",
      "short": "The Everlasting, The Eternal, The Ever-Enduring, The Ever-Present",
      "long": "Allah is Al-Baqi, the everlasting. The one who has always existed and who will never cease to be. He is the one whose existence doesn’t have a beginning nor an end. The virtue of this name signifies Allah as being perpetual, endless, and everlasting. He will remain forever and unaffected by time.",
      "number": 96,
      "meaning": {
        "english": "The Everlasting One",
        "urdu": "ہمیشہ رہنے والا"
      }
    },
    {
      "name": "الْوَارِثُ",
      "inEnglish": "Al-Waarith",
      "inUrdu": "وارث",
      "short": "The Heir, The One whose Existence remains.",
      "long": "Allah is Al-Warith, The One who remains after all has past. He is everlasting and whom all possessions will be returned to.",
      "number": 97,
      "meaning": {
        "english": "The Inhertior",
        "urdu": "وارث"
      }
    },
    {
      "name": "الرَّشِيدُ",
      "inEnglish": "Ar-Rasheed",
      "inUrdu": "رشید",
      "short": "The Guide to the Right Path, The One who guides.",
      "long": "Allah is Ar-Rasheed, the one who guides to rectitude. Allah is the supreme director to the right path and belief. He does not compel people into religion, he has shown the right path through his messengers.",
      "number": 98,
      "meaning": {
        "english": "The Most Righteous Guide",
        "urdu": "ہدایت دینے والا، رہنمائی کرنے والا"
      }
    },
    {
      "name": "الصَّبُورُ",
      "inEnglish": "As-Saboor",
      "inUrdu": "صبور",
      "short": "The Patient, The One who does not quickly punish the sinners.",
      "long": "Allah is As-Sabur, The One who is most patient and enduring. He does not act in a hastily manner but rather waits until the proper time. He does not punish the disobedient and unbelievers, he allows time for them to repent or an opportunity to take the right path.",
      "number": 99,
      "meaning": {
        "english": "The Patient One",
        "urdu": "صبر کرنے والا"
      }
    }
  ]